CSI API ETABS v1

# cDesignSteel Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignSteel

    Public Interface cDesignSteel

    Dim instance As cDesignSteel

    public interface class cDesignSteel

    type cDesignSteel =  interface end

The cDesignSteel type exposes the following members.

Properties

| Name| Description
---|---|---
|
AISC_LRFD93|
|
AISC360_05_IBC2006|
|
Australian_AS4100_2020|
|
Australian_AS4100_98|
|
BS5950_2000|
|
Canadian_S16_09|
|
Canadian_S16_14|
|
Canadian_S16_19|
|
Chinese_2010|
|
Chinese_2018|
|
Eurocode_3_2005|
|
Indian_IS_800_2007|
|
Italian_NTC_2008|
|
Italian_NTC_2018|
|
NewZealand_NZS3404_97|
|
SP16_13330_2011|
Top

Methods

| Name| Description
---|---|---
|
DeleteResults|
|
GetCode|  Retrieves the steel
design code.
|
GetComboDeflection|
| [GetComboStrength](fd2ca8ec-
cbb5-608f-6472-c7df7127506c.htm)|
|
GetDesignSection|
|
GetGroup|
|
GetResultsAvailable|  This
function determines if the steel frame design results are available.
|
GetSummaryResults|
|
GetSummaryResults_2|  DEPRECATED ;
refer to GetSummaryResults_3(String, Int32, String, eFrameDesignOrientation,
String, String, String, Double, Double, Double, Double, String, Double,
String, Double, eItemType)
|
GetSummaryResults_3|  Retrieves
steel frame design summary results
|
GetTargetDispl|
|
GetTargetPeriod|
|
ResetOverwrites|
|
SetAutoSelectNull|
|
SetCode|  Sets the steel design
code.
|
SetComboDeflection|
|
SetComboStrength|
|
SetDesignSection|
|
SetGroup|
|
SetTargetDispl|
|
SetTargetPeriod|
|
StartDesign|  Starts the steel
frame design.
|
VerifyPassed|
|
VerifySections|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com